app/views/orders/edit.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
<h1> Edit Order </h1>
<% @order.order_items.each do |item| %>