app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
SELECT  "orders".* FROM "orders" WHERE "orders"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
        <tr>
          <td><%= item.order_id  %></td>
          <td><%= display_date(item.order.updated_at.to_date) %></td>