app/views/orders/show.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<li>
PRODUCT: <%= item.name %>,
QTY: <%= item.qty %>,
ORDER STATUS: <%= Order.find_by(id: item.id).status %>,
MERCHANT ID: <%= item.merchant_id%>