app/controllers/merchants_controller.rb

  def login
    auth_hash = request.env["omniauth.auth"]
    @merchant = Merchant.find_by(uid: auth_hash[:uid], provider: "github")
---
SELECT  "merchants".* FROM "merchants" WHERE "merchants"."uid" = $1 AND "merchants"."provider" = $2 LIMIT $3  [["uid", "15236701"], ["provider", "github"], ["LIMIT", 1]]