app/controllers/orders_controller.rb

  def update
    if @order.update( order_params )
      if @order.order_items.length == 0
        # sets session to nil if there are no products in the order
        session[:order_id] = nil
        flash[:success] = "Order cancelled: all items removed from cart"
        redirect_to orders_path
      else
        # successfully updates order
        @order.order_items.update(qty: params[:order][:quantity])
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
UPDATE "order_items" SET "qty" = $1, "updated_at" = $2 WHERE "order_items"."id" = $3  [["qty", 3], ["updated_at", "2019-10-24 23:13:56.136077"], ["id", 1]]

  def find_order
    @order = Order.find_by(id: params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]