app/controllers/products_controller.rb

  def index
    @products = Product.where(status: "Available")
---
SELECT "products".* FROM "products" WHERE "products"."status" IS NULL